---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SelectionEditableOnly
source: html/09c70817-87de-9d16-f6ac-d5380d98274d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SelectionEditableOnly Property

"Editable only"

## Syntax (C#)
```csharp
public static ForgeTypeId SelectionEditableOnly { get; }
```